Revit.GeometryConversion.ProtoToRevitSolid.ApplyMaterialToFreeForm(Autodesk.Revit.DB.Document,Revit.Elements.Material,Autodesk.Revit.DB.FreeFormElement)
Apply Material to Solid
familyDocument:
material:
freeform: